{
  "experience": [
    {
      "id": 1,
      "company": {
        "name": "TOT Platform",
        "description": "I working as a Senior Frontend Nextjs Developer at TOT Platform, where I specialize in building high-performance, user-friendly web applications using React.js and modern frontend technologies. At TOT Platform, we focus on delivering cutting-edge digital solutions that enhance user experiences and streamline business operations. My role involves developing interactive and scalable web applications, designing reusable UI components, and optimizing application performance for a seamless user experience. With extensive experience in Next.js, Redux, and Zustand, I ensure clean, maintainable code by following best practices in functional programming and clean architecture. Additionally, I work on API integrations, server-side rendering (SSR), and static site generation (SSG) to enhance application efficiency. I am passionate about continuous learning and leveraging the latest technologies to build innovative and high-quality digital products that meet user expectations.",
        "location": "Giza – Abd El-Moneim Riad.",
        "job_type": "Full Time",
        "job_title": "Next.js Developer",
        "start_date": "10/2023",
        "end_date": "",
        "present": true
      },
      "benefits": [
        "Enhanced user experience by implementing responsive web designs and optimizing application performance.",
        "Developed reusable components to facilitate faster development timelines and improve overall code quality.",
        "Inspected equipment, assessed functionality, and optimized controls.",
        "Increased website traffic with SEO-friendly coding practices and effective use of meta tags in HTML markup.",
        "Updated old code bases to modern development standards, improving functionality."
      ]
    },
    {
      "id": 2,
      "company": {
        "name": "MEC Academy",
        "location": "Dokki",
        "job_type": "Part Time",
        "description": "",
        "job_title": "Instructor",
        "start_date": "11/2023",
        "end_date": "10/2024",
        "present": false
      },
      "benefits": [
        "Design and deliver structured lessons aligned with MEC Academy’s curriculum.",
        "Provide hands-on training and real-world applications to enhance student learning.",
        "Assess student progress through assignments, projects, and evaluations.",
        "Offer mentorship and career guidance to help students achieve their professional goals.",
        "Continuously update course content to reflect industry trends and best practices.",
        "Collaborate with other instructors and staff to improve the learning experience."
      ]
    },
    {
      "id": 3,
      "company": {
        "name": "Active 4 Web",
        "job_type": "Full Time",
        "location": "Nasr City – Makram Ebeid",
        "job_title": "Front-end developer",
        "start_date": "01/2022",
        "end_date": "10/2023",
        "present": false
      },
      "benefits": [
        "Develop and maintain high-performance, scalable, and responsive web applications.",
        "Convert UI/UX designs into pixel-perfect, interactive front-end components.",
        "Optimize web applications for speed, performance, and cross-browser compatibility.",
        "Implement SEO best practices to enhance website visibility and search rankings.",
        "Collaborate with back-end developers to integrate APIs and dynamic content.",
        "Write clean, reusable, and maintainable code following best coding practices.",
        "Troubleshoot, debug, and enhance existing applications for better functionality."
      ]
    }
  ]
}
